[
  {
    "date": "September 20th, 2025",
    "title": "September 20th Update 2025",
    "content": "Greetings to family & friends\n\nWe have just celebrated our 59th Wedding Anniversary on 17th September with a coffee and Millionaires shortbread at Tesco's. Terry dropped off Andrew at 9am for a train to Gatwick to return to Helsinki while Frances' carer looked after her. It was lovely to spend time with Andrew for 5 days during which time he has been able to update Terry's computer so that it will be able to run software for the next decade. Last time we wrote Frances has been admitted to hospital so unfortunately, we missed an Eltham reunion of many young people who met in the 70's and 80's and were privileged to unite them together in marriage. Apparently, we were told it was a great time. We also sadly missed Jim & Margarets 60th wedding anniversary and Jim 80th birthday celebrations also in Eltham. We were planning to spend a few days.\n\nThe first part of Frances hospital visit was very helpful, especially the drip, until she was admitted to a ward at 10pm. It was a nightmare for her. The night staff were unable to take necessary readings even using three different machine and gave her a blanket to sleep until the morning. I found it extremely difficult leaving her and received a call from the staff nurse on my way home that Frances was extremely distressed and to the cut the story short I returned to the hospital and arrange her discharge and brought her home with me. We have moved to a different consultant who leads the frailty clinic. Since then, Frances has managed to stay out of hospital but continues to lose weight now down to 36.8kg. Please pray for a breakthrough.\n\nWe had a great time with Philip & Michelle during their visit in July & August. We saw them for day with Jim & Margaret before they flew over to Switzerland for Bethany's Holtham's wedding to Jeremy before driving to Munich for a few days with Dennis & Lisa and then flying to Helsinki for time with Andrew & Rebecca. Both Philip & Michelle stayed with us the following week and Philip came down in the last week before they returned to Australia.\n\nWe continue to enjoy our online services. Sundays we can found in multi places St Helens Bishopsgate, All Souls Langham Place and Eltham Green Community Church. Our Tuesday night Bible Study for the winter term is now looking at the gospel of Luke and Terry is taking chapter 11 \"Teach us to pray.\n\nTerry continues to unpack boxes deposited in our attic left following Doreen's departure to heaven. We still have 65 or so more to do. Fortunately, we discovered that eBay allow 300 free advertisements each month. I have now added over 1650 items mainly books and sold 200. I have been converting my 750 books on Amazon to Ebay and currently averaging sales of one book a day.\n\nAbigal and Ray are expecting another baby girl on the 2nd January 2026 and she will called Elizabeth Frances. Frances is very excited. Other events since our last update. Esther was 21 on the 18th June, Chloe celebrated her 25th birthday on 22nd August, Andrew & Rebecca celebrated their 29th Wedding anniversary on the 24th August.\n\nWe continue to very much involved with the work of Ameva Farm in Zimbabwe and trust you have been able listen to the story recorded on amevaproject.com. Philip is in the process of making the book available so please watch this space. We were also very saddened to hear of the passing into presence of Lord of Martin Williams who was very much part of Ameva's founding days and led the Bible College until the government of Zimbabwe decided to not allow overseas visitors to stay. We are planning to attend the memorial on the 18th October.\n\nMany thanks for your continued interest in our lives and for your regular support & prayer.\n\nWith much love Terry & Frances"
  },
  {
    "date": "June 22nd, 2025",
    "title": "June 22nd Update",
    "content": "Greetings to family & friends\n\nIt has been some time since we updated our website which last time contained details of our dear friend Doreen who went to be with the Lord on the 1st of January 2025. This follows this update below.\n\nWe are writing today as Frances has just been in hospital again. The last time she was admitted was on the 4th December 2024 after becoming seriously dehydrated due to Dysphasia, a lack of swallowing due to stoke related issues. Since then, she has attended many clinics to determine whether this problem is a physical problem or not and has undergone a few endoscopies to take pictures of the throat, oesophagus, duodenum and stomach This has confirmed this fact that it is not physical.\n\nThe most important programme now is to maintain her weight. In August 22 Frances weighed 56.5KG (8 stone 9 lbs) last week she had dropped to 37.3KG (5 stone 8 lbs). The last couple of weeks Frances has struggled to eat and drink and again has become dehydrated.\n\nOn Friday we were due to join a few couples who had met in Eltham from the mid 70's who had married but unfortunately we needed to go to Casualty. We arrived at 11am and after a good hour asked the Lord if would speed up the process. Within minutes Frances was called. We now had to wait for blood tests etc. Again, we prayed. Within minutes her name was called. Quite remarkably this happened for a third time. The Lord is very faithful.\n\nThose who read our webpage would know that back in March last year during a crisis time we prayed, and the Lord clearly spoke \"Lay hands on the sick and they will recover\" There was a remarkable change but not a complete healing. We pray daily for this promise to be fulfilled. We are on a journey to discover the outworking of this truth Friday following our third answer to prayer we were taken into a treatment area and Frances was put on a drip and as they indicated they were keeping her in for further treatment I returned home for some overnight gear. I arrived back in casualty to wait again and at 10pm she was moved to an Accident and Emergency ward.\n\nThis time things did not work out too well. The night staff were unable to take necessary readings even using three different machine and gave her a blanket to sleep until the morning. I found it extremely difficult leaving her and received a call from the staff nurse on my way home that Frances was extremely distressed and to the cut the story shorter I returned to the hospital and arrange her discharge and brought her home with me.\n\nWhere we go from here, I do not know but I am sure the Lord will open the way for us. The day began so well but ended extremely badly. Moving on to other things. Early next month we shall be seeing something of Philip & Michelle who will be arriving from Perth Australia to spend some time in the UK, Europe and Scandinavia. They hope to visit Andrew & Rebecca in Helsinki.\n\nOver the last 6 months we seemed to have reconnected with many of those who we have known since the early 70's when we became part of \"The Fellowships\" for example last month we were introduced to a Zoom group sharing a bible study on Tuesday evening on the book of Hebrews. I have now been invited to take the theme of faith in Hebrews 11 which has been exercising my thoughts since the Lord spoke back last year. I have found my studies extremely challenging.\n\nI continue to unpack boxes deposited in our attic left following Doreens departure to heaven. We still have 70 or so to do. Fortunately, we discovered that eBay allow 300 free advertisements each month. I have managed nearly 900 to date having shipped over 120.\n\nWe have also continued to convert our home back to our own purposes although now as Frances full time carer, I have so little time. Each afternoon we need to find a time for drinking coffee.\nMany thanks for your continued interest in our lives and for your regular support & prayer.\n\nWith much love Terry & Frances"
  }
]