{
  "intro": "We continue to be very much involved with the work of Ameva Farm in Zimbabwe. The story has been recorded and is available to listen to on <a href=\"https://amevaproject.com\" target=\"_blank\" rel=\"noopener noreferrer\">amevaproject.com</a>.",
  "sections": [
    {
      "title": "About Ameva",
      "content": "The Ameva Project is a work which began in 1981 and has continued until this day. The story unfolds to tell of the lives of John & Celia Valentine, their family, workers from around the world and the many hundreds of people that have been impacted by this work.",
      "isHighlight": false
    },
    {
      "title": "History Recording",
      "content": "Terry is doing well with recording the History of the Ameva Project with Mike Coles. Each Monday they spend an hour or so together, recording chapters that cover different periods of the project's history.\n\nThe accounts are taken from the many Zimbabwe Project Newsletters sent out by John & Celia, Fellowship Missionary Digests produced to keep the Christian Fellowships up to date with missionary news, Ameva Updates, Ameva Weekly's sent out by email each week and the Reports and Reflections of those who have travelled out to work in the Bible School, Primary School, Secondary School, on the Farm and from Shephen Mbewe whose family grew up there.\n\nThese can be listened to by logging on to the Ameva page on our website. Philip is in the process of making the book available so please watch this space.",
      "isHighlight": false
    },
    {
      "title": "Memorial",
      "content": "We were very saddened to hear of the passing into presence of Lord of Martin Williams who was very much part of Ameva's founding days and led the Bible College until the government of Zimbabwe decided to not allow overseas visitors to stay.",
      "isHighlight": false
    },
    {
      "title": "Listen to the Story",
      "content": "You can listen to the recorded history and updates by visiting <a href=\"https://amevaproject.com\" target=\"_blank\" rel=\"noopener noreferrer\">amevaproject.com</a>.",
      "isHighlight": true
    }
  ]
}

